Тест_ЗУП_31_КОРП/src/Documents/ИзменениеГрафикаРаботыСписком/ИзменениеГрафикаРаботыСписком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеГрафикаРаботыСписком</name>
  <registerRecords>InformationRegister.УдалитьЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ГрафикРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПараметрыПериодовСтажаПФР</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ИзменениеГрафикаРаботыСписком</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПересчетТарифныхСтавок</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СовокупнаяТарифнаяСтавка</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифнойСтавки</name>
      <type>
        <types>EnumRef.ВидыТарифныхСтавок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>КомпенсационныеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>КвартальнаяПремия</name>
  </enumValues>
  <enumValues>
    <name>РайонныйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УправленческийУчет</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеКомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпускеГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпуске</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоБолезни</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКомандировки</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ОплатаСверхурочныхВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоТрехЛет</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособиеМесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаСовмещение</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаработокНаВремяТрудоустройства</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>Льгота</name>
  </enumValues>
  <enumValues>
    <name>ВыбираемаяСотрудникомЛьгота</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВредность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПредыдущимиДокументами</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоначислениеДоУправленческогоУчета</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияМоральногоВреда</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>РаботаВОтпускеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПростойНеЗависящийОтРаботодателяИРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйОплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеГосударственныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ИзменениеГрафикаРаботыСписком/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаДокумента() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ИзменениеГрафикаРаботыСписком;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаДокументаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВКоллекциюКомандуСозданияДокументаПоМетаданнымДокумента(
		КомандыСозданияДокументов, Метаданные.Документы.ИзменениеГрафикаРаботыСписком);
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приказ об изменении графика работы.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "ЗарплатаКадрыКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
	КомандаПечати.Идентификатор = "ПФ_MXL_ИзмененияГрафикаРаботыСписком";
	КомандаПечати.Представление = НСтр("ru = 'Приказ об изменении графика работы'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;
	
КонецПроцедуры

#Область ЗаполнениеДокумента

Процедура РассчитатьФОТ(Знач Ссылка, Знач Организация, Знач ДатаИзменения, Знач ГрафикРаботы, НачисленияСотрудников, ТарифныеСтавкиСотрудников) Экспорт
	СотрудникиДаты = Новый ТаблицаЗначений;
	СотрудникиДаты.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СотрудникиДаты.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	
	ДатаСобытия = НачалоДня(ДатаИзменения);
	
	Для Каждого СтрокаНачисления Из НачисленияСотрудников Цикл
		НоваяСтрока = СотрудникиДаты.Добавить();
		НоваяСтрока.ДатаСобытия = ДатаСобытия;
		НоваяСтрока.Сотрудник = СтрокаНачисления.Сотрудник;
	КонецЦикла;
	
	ВремяРегистрацииДокумента = ЗарплатаКадрыРасширенный.ЗначенияВремениРегистрацииДокумента(Ссылка, СотрудникиДаты);
	ВремяРегистрацииСотрудников = ВремяРегистрацииДокумента.Получить(ДатаСобытия);
	
	ТаблицаНачислений = ПлановыеНачисленияСотрудников.ТаблицаНачисленийДляРасчетаВторичныхДанных();
	ТаблицаПоказателей = ПлановыеНачисленияСотрудников.ТаблицаИзвестныеПоказатели();
	КадровыеДанные = ПлановыеНачисленияСотрудников.СоздатьТаблицаКадровыхДанных();
	
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
	
	Для Каждого СтрокаНачисления Из НачисленияСотрудников Цикл
		ВремяРегистрации = ВремяРегистрацииСотрудников.Получить(СтрокаНачисления.Сотрудник);
		
		СтрокаКадровыхДанных = КадровыеДанные.Добавить();
		СтрокаКадровыхДанных.Сотрудник = СтрокаНачисления.Сотрудник;
		СтрокаКадровыхДанных.Период = ВремяРегистрации;
		СтрокаКадровыхДанных.ГрафикРаботы = ГрафикРаботы;
		СтрокаКадровыхДанных.Организация = Организация;
				
		ДанныеНачисления = ТаблицаНачислений.Добавить();
		ДанныеНачисления.Сотрудник = СтрокаНачисления.Сотрудник;
		ДанныеНачисления.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ДанныеНачисления.Период = ВремяРегистрации;
		ДанныеНачисления.Начисление = СтрокаНачисления.Начисление;
		ДанныеНачисления.ДокументОснование = СтрокаНачисления.ДокументОснование;
		ДанныеНачисления.Размер = СтрокаНачисления.Размер;
	КонецЦикла;
	
	РассчитанныеДанные = ПлановыеНачисленияСотрудников.РассчитатьВторичныеДанныеПлановыхНачислений(ТаблицаНачислений, , КадровыеДанные);
		
	Для Каждого НачислениеСотрудника Из НачисленияСотрудников Цикл
		
		Отбор = Новый Структура("Сотрудник, Начисление, ДокументОснование", НачислениеСотрудника.Сотрудник, НачислениеСотрудника.Начисление, НачислениеСотрудника.ДокументОснование);
		СтрокиНачисления = РассчитанныеДанные.ПлановыйФОТ.НайтиСтроки(Отбор);
		Если СтрокиНачисления.Количество() > 0 Тогда
			НачислениеСотрудника.Размер = СтрокиНачисления[0].ВкладВФОТ;
		КонецЕсли; 

	КонецЦикла;
	
	Для Каждого СтрокатарифнойСтавки Из РассчитанныеДанные.ТарифныеСтавки Цикл
		НайденныеСтроки = ТарифныеСтавкиСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокатарифнойСтавки.Сотрудник));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].ВидТарифнойСтавки = СтрокатарифнойСтавки.ВидТарифнойСтавки;
			НайденныеСтроки[0].СовокупнаяТарифнаяСтавка = СтрокатарифнойСтавки.СовокупнаяТарифнаяСтавка;
		Иначе
			СтрокаТаблицы = ТарифныеСтавкиСотрудников.Добавить();
			СтрокаТаблицы.Сотрудник = СтрокатарифнойСтавки.Сотрудник;
			СтрокаТаблицы.ВидТарифнойСтавки = СтрокатарифнойСтавки.ВидТарифнойСтавки;
			СтрокаТаблицы.СовокупнаяТарифнаяСтавка = СтрокатарифнойСтавки.СовокупнаяТарифнаяСтавка;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

Функция СотрудникиДляИзмененияГрафика(Организация, Подразделение, ДатаИзменения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Параметры.Организация = Организация;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Параметры.Подразделение = Подразделение;
	КонецЕсли;
	Параметры.НачалоПериода 	= ДатаИзменения;
	Параметры.ОкончаниеПериода 	= ДатаИзменения;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Модуль.ДобавитьОтборыПоВидуДоговора(Параметры.Отборы);
	КонецЕсли; 
	
	Возврат КадровыйУчет.СотрудникиОрганизации(Истина, Параметры).ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

Функция НачисленияСотрудников(Ссылка, ДатаИзменения, СписокСотрудников) Экспорт
	
	СотрудникиДаты = Новый ТаблицаЗначений;
	СотрудникиДаты.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СотрудникиДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СотрудникиДаты.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	
	ДатаСобытия = НачалоДня(ДатаИзменения);
	
	Для Каждого Сотрудник Из СписокСотрудников Цикл 
		НоваяСтрока = СотрудникиДаты.Добавить();
		НоваяСтрока.ДатаСобытия = ДатаСобытия;
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЦикла;
	
	ВремяРегистрацииДокумента = ЗарплатаКадрыРасширенный.ЗначенияВремениРегистрацииДокумента(Ссылка, СотрудникиДаты);
	ВремяРегистрацииСотрудников = ВремяРегистрацииДокумента.Получить(ДатаСобытия);
	
	Для Каждого СтрокаСотрудника Из СотрудникиДаты Цикл 
		СтрокаСотрудника.Период = ВремяРегистрацииСотрудников.Получить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СотрудникиДаты", СотрудникиДаты);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиДаты.Сотрудник КАК Сотрудник,
	|	СотрудникиДаты.Период КАК Период
	|ПОМЕСТИТЬ ВТИзмеренияДаты
	|ИЗ
	|	&СотрудникиДаты КАК СотрудникиДаты";
	
	Запрос.Выполнить();
	
	// Подготовка сведений о плановых начислениях сотрудников.
	ЗапросВТПлановыеНачисления = КадровыйУчетРасширенный.ЗапросВТПлановыеНачисленияСотрудников(Истина, "ВТПлановыеНачисленияСотрудников", "ВТИзмеренияДаты", "Сотрудник,Период");
	ЗапросВТПлановыеНачисления.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТПлановыеНачисления.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлановыеНачисления.Сотрудник,
	|	ПлановыеНачисления.Начисление,
	|	ПлановыеНачисления.ДокументОснование,
	|	ПлановыеНачисления.Размер,
	|	ВЫРАЗИТЬ(ПлановыеНачисления.Начисление КАК ПланВидовРасчета.Начисления).РеквизитДопУпорядочивания КАК Порядок,
	|	ЛОЖЬ КАК ФиксСтрока
	|ИЗ
	|	ВТПлановыеНачисленияСотрудников КАК ПлановыеНачисления
	|ГДЕ
	|	НЕ ВЫРАЗИТЬ(ПлановыеНачисления.Начисление КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоПолутораЛет), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	НачисленияСотрудников = Запрос.Выполнить().Выгрузить();
	
	Возврат НачисленияСотрудников;
	
КонецФункции

Функция ТекущиеЗначенияСовокупныхТарифныхСтавокСотрудников(Ссылка, ДатаИзменения, МассивСотрудников) Экспорт 
	
	СотрудникиДаты = Новый ТаблицаЗначений;
	СотрудникиДаты.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СотрудникиДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СотрудникиДаты.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	
	ДатаСобытия = НачалоДня(ДатаИзменения);
	
	Для Каждого Сотрудник Из МассивСотрудников Цикл 
		НоваяСтрока = СотрудникиДаты.Добавить();
		НоваяСтрока.ДатаСобытия = ДатаСобытия;
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЦикла;
	
	ВремяРегистрацииДокумента = ЗарплатаКадрыРасширенный.ЗначенияВремениРегистрацииДокумента(Ссылка, СотрудникиДаты);
	ВремяРегистрацииСотрудников = ВремяРегистрацииДокумента.Получить(ДатаСобытия);
	
	Для Каждого СтрокаСотрудника Из СотрудникиДаты Цикл 
		СтрокаСотрудника.Период = ВремяРегистрацииСотрудников.Получить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СотрудникиДаты", СотрудникиДаты);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиДаты.Сотрудник КАК Сотрудник,
	|	СотрудникиДаты.Период КАК Период
	|ПОМЕСТИТЬ ВТИзмеренияДаты
	|ИЗ
	|	&СотрудникиДаты КАК СотрудникиДаты";
	
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Ложь;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "РегистраторСобытия", "<>", Ссылка);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПлановыйФОТИтоги",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИзмеренияДаты",
			"Сотрудник"),
		ПараметрыПостроения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСовокупныхТарифныхСтавок.Сотрудник,
	|	ЗначенияСовокупныхТарифныхСтавок.СовокупнаяТарифнаяСтавка КАК СовокупнаяТарифнаяСтавка,
	|	ЗначенияСовокупныхТарифныхСтавок.ВидТарифнойСтавки
	|ИЗ
	|	ВТПлановыйФОТИтогиСрезПоследних КАК ЗначенияСовокупныхТарифныхСтавок
	|ГДЕ
	|	ЗначенияСовокупныхТарифныхСтавок.СовокупнаяТарифнаяСтавка <> 0";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

Функция ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок) Экспорт
	
	ДанныеДляРегистрацииВУчете = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеГрафикаРаботыСотрудники.Ссылка КАК Ссылка,
	|	ИзменениеГрафикаРаботыСотрудники.Сотрудник КАК Сотрудник,
	|	ИзменениеГрафикаРаботыСписком.ДатаИзменения КАК ДатаНачала,
	|	ИзменениеГрафикаРаботыСписком.ДатаОкончания КАК ДатаОкончания,
	|	ИзменениеГрафикаРаботыСписком.Организация КАК Организация,
	|	ИзменениеГрафикаРаботыСписком.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ИзменениеГрафикаРаботыСписком.Сотрудники КАК ИзменениеГрафикаРаботыСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеГрафикаРаботыСписком КАК ИзменениеГрафикаРаботыСписком
	|		ПО ИзменениеГрафикаРаботыСотрудники.Ссылка = ИзменениеГрафикаРаботыСписком.Ссылка
	|ГДЕ
	|	ИзменениеГрафикаРаботыСотрудники.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов", "Сотрудник,ДатаНачала");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Ложь, "ВидЗанятости");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Сотрудник,
	|	ДанныеДокументов.ДатаНачала,
	|	ДанныеДокументов.ДатаОкончания,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.ГрафикРаботы,
	|	КадровыеДанныеСотрудников.ВидЗанятости
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО ДанныеДокументов.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И ДанныеДокументов.ДатаНачала = КадровыеДанныеСотрудников.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеДляРегистрацииВУчетеПоДокументу = УчетСтажаПФР.ДанныеДляРегистрацииВУчетеСтажаПФР();
		ДанныеДляРегистрацииВУчете.Вставить(Выборка.Ссылка, ДанныеДляРегистрацииВУчетеПоДокументу); 
		
		ОписаниеПериода = УчетСтажаПФР.ОписаниеРегистрируемогоПериода();
		ОписаниеПериода.Сотрудник = Выборка.Сотрудник;
		ОписаниеПериода.ДатаНачалаПериода = Выборка.ДатаНачала;
		ОписаниеПериода.ДатаОкончанияПериода = Выборка.ДатаОкончания;
		ОписаниеПериода.Состояние = Перечисления.СостоянияСотрудника.Работа;
		ОписаниеПериода.ВидЗанятости = Выборка.ВидЗанятости;
		
		РегистрируемыйПериод = УчетСтажаПФР.ДобавитьЗаписьВДанныеДляРегистрацииВУчета(ДанныеДляРегистрацииВУчетеПоДокументу, ОписаниеПериода);
		
		УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "ГрафикРаботы", Выборка.ГрафикРаботы);
		
	КонецЦикла;
	
	Возврат ДанныеДляРегистрацииВУчете;
	
КонецФункции

Функция ДанныеДляПроверкиОграниченийНаУровнеЗаписей(Объект) Экспорт 

	ФизическиеЛица = ?(Объект.ФизическиеЛица.Количество() > 0 , Объект.ФизическиеЛица.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), Справочники.ФизическиеЛица.ПустаяСсылка());
	
	ДанныеДляПроверкиОграничений = ЗарплатаКадрыРасширенный.ОписаниеСтруктурыДанныхДляПроверкиОграниченийНаУровнеЗаписей();
	
	ДанныеДляПроверкиОграничений.Организация = Объект.Организация;
	ДанныеДляПроверкиОграничений.МассивФизическихЛиц = ФизическиеЛица;
	ДанныеДляПроверкиОграничений.Подразделение = Объект.Подразделение;
	
	Возврат ДанныеДляПроверкиОграничений;
	
КонецФункции

Функция ПолныеПраваНаДокумент() Экспорт 
	
	Возврат Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплатыРасширенная, ЧтениеДанныхДляНачисленияЗарплатыРасширенная", , Ложь);
	
КонецФункции

#КонецОбласти

#КонецЕсли
